In [ ]:
import pandas as pd 
import numpy as np

In [ ]:
dataset = pd.read_csv("student.csv")
dataset.head()

   rollno              name   sci   eng  math   nep total
0       1   Anisha Bhandari  78.0  76.0   NaN  72.0   279
1       2    Gita Bhattarai  91.0   NaN  62.0   NaN   NaN
2       3               NaN   NaN  46.0  99.0   NaN   307
3       4  Pramila Maharjan  54.0  60.0  96.0  62.0   272
4       5  Krishna Shrestha  82.0  48.0  79.0  63.0   272

In [ ]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49 entries, 0 to 48
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   rollno  49 non-null     int64
 1   name    45 non-null     object
 2   sci     46 non-null     float64
 3   eng     41 non-null     float64
 4   math    37 non-null     float64
 5   nep     41 non-null     float64
 6   total   45 non-null     object
dtypes: float64(4), int64(1), object(2)
memory usage: 2.8+ KB

In [ ]:
#  dataset.info()
#  dataset['total']=dataset['total'].fillna(dataset['total'].mode())
#  dataset['total'] = dataset['total'].astype('int64')
#  dataset.info()

In [ ]:
dataset['total'].fillna(0,inplace=True)
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49 entries, 0 to 48
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   rollno  49 non-null     int64
 1   name    45 non-null     object
 2   sci     46 non-null     float64
 3   eng     41 non-null     float64
 4   math    37 non-null     float64
 5   nep     41 non-null     float64
 6   total   49 non-null     object
dtypes: float64(4), int64(1), object(2)
memory usage: 2.8+ KB

C:\Users\Acer\AppData\Local\Temp\ipykernel_13764\856488810.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset['total'].fillna(0,inplace=True)

In [ ]:
dataset['total'].unique()

array(['279', 0, '307', '272', '246', '288', '297', '304', '273', '276',
       '252', '249', '332', '352', '248', '229', '259', ' ', '234', '251',
       '316', '197', '256', '313', '173', '271', '291', '303', '219',
       '282', '311', '198', '275', '312'], dtype=object)

In [ ]:
dataset['total'].dtype

dtype('O')

In [ ]:
# dataset['total'] = dataset['total'].astype('Int64')     #normal int to float only not object 
dataset['total'] = pd.to_numeric(dataset['total'], errors='coerce').astype('Int64')
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49 entries, 0 to 48
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   rollno  49 non-null     int64
 1   name    45 non-null     object
 2   sci     46 non-null     float64
 3   eng     41 non-null     float64
 4   math    37 non-null     float64
 5   nep     41 non-null     float64
 6   total   41 non-null     Int64
dtypes: Int64(1), float64(4), int64(1), object(1)
memory usage: 2.9+ KB

In [ ]:
dataset_2 = pd.read_csv('student_per.csv')
dataset_2.head(7)

,student_id,weekly_self_study_hours,attendance_percentage,class_participation,total_score,grade
0,1,18.5,95.6,3.8,97.9,A
1,2,14.0,80.0,2.5,83.9,B
2,3,19.5,86.3,5.3,100.0,A
3,4,25.7,70.2,7.0,100.0,A
4,5,13.4,81.9,6.9,92.0,A
5,6,13.4,65.1,5.0,97.5,A
6,7,26.1,81.8,5.9,100.0,A

In [ ]:
en_data = dataset_2['grade']
en_data.head(6)

0    A
1    B
2    A
3    A
4    A
5    A
Name: grade, dtype: object

In [ ]:
pd.get_dummies(en_data)

         A      B      C      D      F
0     True  False  False  False  False
1    False   True  False  False  False
2     True  False  False  False  False
3     True  False  False  False  False
4     True  False  False  False  False
..     ...    ...    ...    ...    ...
993  False   True  False  False  False
994  False  False   True  False  False
995  False   True  False  False  False
996   True  False  False  False  False
997   True  False  False  False  False

[998 rows x 5 columns]

In [ ]:
pd.get_dummies(en_data).astype('int')

     A  B  C  D  F
0    1  0  0  0  0
1    0  1  0  0  0
2    1  0  0  0  0
3    1  0  0  0  0
4    1  0  0  0  0
..  .. .. .. .. ..
993  0  1  0  0  0
994  0  0  1  0  0
995  0  1  0  0  0
996  1  0  0  0  0
997  1  0  0  0  0

[998 rows x 5 columns]

In [ ]:
dataset_2

,student_id,weekly_self_study_hours,attendance_percentage,class_participation,total_score,grade
0,1,18.5,95.6,3.8,97.9,A
1,2,14.0,80.0,2.5,83.9,B
2,3,19.5,86.3,5.3,100.0,A
3,4,25.7,70.2,7.0,100.0,A
4,5,13.4,81.9,6.9,92.0,A
...,...,...,...,...,...,...
993,994,10.2,77.6,4.0,76.8,B
994,995,8.0,94.0,5.4,66.2,C
995,996,13.0,72.5,3.2,78.1,B
996,997,27.6,92.9,6.5,100.0,A
997,998,19.5,70.2,5.5,91.7,A